v2206/Projects/ADTank_2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-4;

deltaT          1e-4;

adjustableRunTime yes; 

writeControl    timeStep; // runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision   6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

// maxCo           0.9;

// runTimeModifiable true;

// ************************************************************************* //
