v2206/Projects/ADTank_2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -150    -150   -1 )  // 0
    (  150    -150   -1 )  // 1
    (  150     150   -1 )  // 2
    ( -150     150   -1 )  // 3
    ( -150    -150    1 )  // 4
    (  150    -150    1 )  // 5
    (  150     150    1 )  // 6
    ( -150     150    1 )  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 1) simpleGrading (1 1 1) //(64 64 96) simpleGrading (1 1 1)
);

edges
(
);

boundary 
(
    allBoundary
    {
        type patch;
        faces
        (
            (6 2 1 5)
            (7 3 2 6)
            (4 0 3 7)
            (5 1 0 4)
        );
    }

    top 
    {
        type empty;
        faces
        (
            (6 5 4 7)
            (1 2 3 0) 
        );
    }
);

// ************************************************************************* //
