v2206/Projects/ADTank_2D/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    
    GeoTank
    {
        type triSurfaceMesh;
        file "GeoTank.stl";
    }
    GeoShaft
    {
        type triSurfaceMesh;
        file "GeoShaft.stl";
    }
    // //- Used to define MRF zone and refine mesh round the GeoShaft 
    // MRF
    // {
    //     type searchableCylinder;
    //     point1 (0.0  0.0  -81);
    //     point2 (0.0  0.0   81);
    //     radius 51;
    // }
}


castellatedMeshControls
{

    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 5;
    nCellsBetweenLevels 1;
    resolveFeatureAngle 15; 
    maxLoadUnbalance 0.10;

    features
    (
        {
            file "GeoTank.eMesh";
            level 3;
        }

        {
            file "GeoShaft.eMesh";
            level 3;
        }

    );

    refinementSurfaces
    {
        GeoTank
        {
            level (3 3);
            // patchInfo { type wall; }
        }

        GeoShaft
        {
            level (3 3);
        }

        // MRF
        // {
        //     level (1 1);
        //     cellZone cellMRFzone;
        //     faceZone faceMRFzone;
        //     cellZoneInside inside;
        // }
    }

    refinementRegions
    {
        // MRF
        // {
        //     mode inside;
        //     levels ((1E15 1));
        // }
    }

    locationInMesh (20 20 0); // Inside point
    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              100;
    nRelaxIter              20;
    nFeatureSnapIter        20;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
    nFaceSplitInterval      5;
}

// Settings for the layer addition.
addLayersControls
{
    layers
    {
        GeoTank
        {
            nSurfaceLayers 3;
        }

        GeoShaft
        {
            nSurfaceLayers 3;
        }
    }

    relativeSizes           true;
    expansionRatio          1.5;
    finalLayerThickness     0.5;
    minThickness            0.3;
    nGrow                   0;

    featureAngle            180;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90; // 60;
    nBufferCellsNoExtrude   0;

    nLayerIter              50;
    nRelaxedIter            20;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }
}

writeFlags
(
);

mergeTolerance 1E-6;


// ************************************************************************* //
