v2206/Projects/ADTank_2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    allBoundary
    {
        type            patch;
        nFaces          0;
        startFace       49370;
    }
    top
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6594;
        startFace       49370;
    }
    GeoTank
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7744;
        startFace       55964;
    }
    GeoShaft
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1405;
        startFace       63708;
    }
)

// ************************************************************************* //
