v2206/Projects/ADTank_2D/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// surfaces
// (
//     "GeoShaft.stl"
//     "GeoTank.stl"
//     // "vessel.stl"
// );

// // Identify a feature when angle between faces < includedAngle
// includedAngle       150;

GeoShaft.stl {
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 170; }
}

GeoTank.stl {
    extractionMethod            extractFromSurface;
    extractFromSurfaceCoeffs    { includedAngle 170; }
}

// vessel.stl {
//     extractionMethod            extractFromSurface;
//     extractFromSurfaceCoeffs    { includedAngle 150; }
// }

// ************************************************************************* //
